Revit 2027 API
OBJExportOptions.GridAspectRatio Property
 The maximum aspect ratio allowed in the grid placed across the face. The minimum allowed value is 1.0. The maximum allowed value is 10.0. By default this property is ignored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GridAspectRatio { get; set; }
Public Property GridAspectRatio As Double
	Get
	Set
public:
property double GridAspectRatio {
	double get ();
	void set (double value);
}
member GridAspectRatio : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The value gridAspectRatio is outside the allowable range of values for GridAspectRatio tessellation parameter.
InvalidOperationException |  GridAspectRatio tessellation parameter is default (hasn't been explicitly set by the user) and cannot be obtained now.
Remarks
 This property can be set by using export resolution type (by creation of OBJExportOptions or using [!:Autodesk::Revit::DB::OBJExportOptions::setTessellationSettings(ExportResolution::Enum)] method). In the case of Fine, Medium and Coarse resolutions, this property has the same value (10.0) and it is considered as explicitly set by the user. In the case of Custom resolution type, this property is only allowed to be obtained if it has been explicitly set.
See Also
Reference
OBJExportOptions Class
Autodesk.Revit.DB Namespace